# Introduction to Pandas

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

#### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [1]:
# your code here
import numpy as np
import pandas as pd

#### 2. Create a Pandas Series containing the elements of the list below.

In [6]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [11]:
# your code here
data_s = pd.Series(lst)
print(data_s)

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

#### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [12]:
# your code here
print('The thrid value in Series data_s above is %f.' % data_s[2])

The thrid value in Series data_s above is 74.400000.

#### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [20]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [15]:
# your code here
df_b = pd.DataFrame(b) 
df_b

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

#### 5. Rename the data frame columns based on the names in the list below.

In [21]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']

In [24]:
# your code here
df_b.columns = colnames
df_b

   Score_1  Score_2  Score_3  Score_4  Score_5
0     53.1     95.0     67.5     35.0     78.4
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9
5     49.0     69.0      0.1     31.8     89.1
6     23.3     40.7     95.0     83.8     26.9
7     27.6     26.4     53.8     88.8     68.5
8     96.6     96.4     53.4     72.4     50.1
9     73.7     39.0     43.2     81.6     34.7

#### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [35]:
# your code here
df_b_sub = df_b[['Score_1','Score_3','Score_5']]
df_b_sub

   Score_1  Score_3  Score_5
0     53.1     67.5     78.4
1     61.3     30.8     87.6
2     20.6     44.2     91.8
3     57.4     96.1     69.5
4     83.6     85.4     35.9
5     49.0      0.1     89.1
6     23.3     95.0     26.9
7     27.6     53.8     68.5
8     96.6     53.4     50.1
9     73.7     43.2     34.7

#### 7. From the original data frame, calculate the average Score_3 value.

In [41]:
# your code here
avg_bs3 = df_b['Score_3'].sum() % len(df_b['Score_3'])
print('The average of column Score_3 is %f.' % avg_bs3)

The average of column Score_3 is 9.500000.

#### 8. From the original data frame, calculate the maximum Score_4 value.

In [42]:
# your code here
max_bs4 = df_b['Score_4'].max()
print('The maximum of column Score_4 is %f.' % max_bs4)

The maximum of column Score_4 is 88.800000.

#### 9. From the original data frame, calculate the median Score 2 value.

In [44]:
# your code here
med_bs2 = df_b['Score_2'].median()
print('The median of column Score_2 is %f.' % med_bs2)

The median of column Score_2 is 40.750000.

#### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [45]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [46]:
# your code here
df_orders = pd.DataFrame.from_dict(orders, orient = 'index')
df_orders

,0,1,2,3,4,5,6,7,8,9
Description,LUNCH BAG APPLE DESIGN,SET OF 60 VINTAGE LEAF CAKE CASES,RIBBON REEL STRIPES DESIGN,WORLD WAR 2 GLIDERS ASSTD DESIGNS,PLAYING CARDS JUBILEE UNION JACK,POPCORN HOLDER,BOX OF VINTAGE ALPHABET BLOCKS,PARTY BUNTING,JAZZ HEARTS ADDRESS BOOK,SET OF 4 SANTA PLACE SETTINGS
Quantity,1,24,1,2880,2,7,1,4,10,48
UnitPrice,1.65,0.55,1.65,0.18,1.25,0.85,11.95,4.95,0.19,1.25
Revenue,1.65,13.2,1.65,518.4,2.5,5.95,11.95,19.8,1.9,60

In [74]:
df_orders1 = pd.DataFrame(orders).transpose()
df_orders1

,0,1,2,3,4,5,6,7,8,9
Description,LUNCH BAG APPLE DESIGN,SET OF 60 VINTAGE LEAF CAKE CASES,RIBBON REEL STRIPES DESIGN,WORLD WAR 2 GLIDERS ASSTD DESIGNS,PLAYING CARDS JUBILEE UNION JACK,POPCORN HOLDER,BOX OF VINTAGE ALPHABET BLOCKS,PARTY BUNTING,JAZZ HEARTS ADDRESS BOOK,SET OF 4 SANTA PLACE SETTINGS
Quantity,1,24,1,2880,2,7,1,4,10,48
UnitPrice,1.65,0.55,1.65,0.18,1.25,0.85,11.95,4.95,0.19,1.25
Revenue,1.65,13.2,1.65,518.4,2.5,5.95,11.95,19.8,1.9,60

#### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [57]:
df_orders.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Description to Revenue
Data columns (total 10 columns):
0    4 non-null object
1    4 non-null object
2    4 non-null object
3    4 non-null object
4    4 non-null object
5    4 non-null object
6    4 non-null object
7    4 non-null object
8    4 non-null object
9    4 non-null object
dtypes: object(10)
memory usage: 352.0+ bytes

In [67]:
# your code here
total_qty_ordered = df_orders.iloc[1,:].sum()
total_rev = df_orders.iloc[3,:].sum()
print('The total quantity ordered is %d and revenue generated from these orders is %f.' % (total_qty_ordered, total_rev))

The total quantity ordered is 2978 and revenue generated from these orders is 637.000000.

#### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [114]:
# your code here
highest_p = df_orders.iloc[2,:].max()
ordri = pd.Index(df_orders).tolist() 
highest = [ordri[0][i] for i in range(len(ordri[0])) if ordri[2][i] == pd.Series((ordri[2])).max()]

lowest_p = df_orders.iloc[2,:].min()
lowest = [ordri[0][i] for i in range(len(ordri[0])) if ordri[2][i] == pd.Series((ordri[2])).min()]
price_diff = highest_p - lowest_p
print('The most expensive item(s) ordered is %str priced at %f.' % (highest[0], highest_p))
print('The least expensive item(s) ordered is %str priced at %f.' % (lowest[0], lowest_p))
print('Price difference between the above two is %f.' % price_diff)

The most expensive item(s) ordered is BOX OF VINTAGE ALPHABET BLOCKStr priced at 11.950000.
The least expensive item(s) ordered is WORLD WAR 2 GLIDERS ASSTD DESIGNStr priced at 0.180000.
Price difference between the above two is 11.770000.